app/controllers/grubs_controller.rb

  def index
    @grubs = Grub.all
---
SELECT "grubs".* FROM "grubs"

  def create
    @grub = Grub.new(grub_params)

    respond_to do |format|
      if @grub.save
---
INSERT INTO "grubs" ("name", "cuisine", "calories", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "Chicken Adobo"], ["cuisine", "Filipino"], ["calories", 300], ["price", "Php 180"], ["created_at", "2024-02-19 13:12:45.522102"], ["updated_at", "2024-02-19 13:12:45.522102"]]

  def update
    respond_to do |format|
      if @grub.update(grub_params)
---
UPDATE "grubs" SET "calories" = $1, "updated_at" = $2 WHERE "grubs"."id" = $3  [["calories", 12], ["updated_at", "2024-02-20 10:30:14.576596"], ["id", 2]]

  def destroy
    @grub.destroy!
---
DELETE FROM "grubs" WHERE "grubs"."id" = ?  [["id", 1]]

    def set_grub
      @grub = Grub.find(params[:id])
---
SELECT "grubs".* FROM "grubs" WHERE "grubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]